[
  {
    "path": "blog/PuneFOSS_2.0/",
    "title": "PuneFOSS 2.0: A Dive into Open Source Insights and Initiatives",
    "description": "In February 2024, I got the opportunity to participate in FOSS United's one day conferene PuneFOSS 2.0. With this blog, the reader wil come to know about FOSS in general, the talks at the conference, and my views.",
    "author": [
      {
        "name": "Jyoti Bhogal",
        "url": "https://jyoti-bhogal.github.io/about-me/"
      }
    ],
    "date": "2024-03-08",
    "categories": [
      "Open Source",
      "Community Building",
      "FOSS",
      "FOSS United",
      "Open Science",
      "Experience Blog"
    ],
    "contents": "\r\nOpen SourceIntroduction\r\nRecently, I had the privilege of attending PuneFOSS 2.0, a one-day conference hosted by the FOSS United community at College of Engineering Pune, India on 24th Feb 2024. The conference had an impressive lineup of speakers, including industry experts like Vishal Arya, Rahul Kulkarni, Rohaan Goswami, Faeka Ansari, Mohammed Ali Chherwalla, Pranay Narang, Praveen Kumar, and Siddharth Jha, culminating in a thought-provoking panel discussion. This blog highlights some key insights shared during the event.\r\nWhat is FOSS?\r\nFOSS, an acronym for Free and Open Source Software, embodies a software development philosophy centered on freedom and openness. The term ‘Free’ denotes users’ liberty to run, alter, and share the software, while ‘Open Source’ signifies that the software’s source code is available for users to inspect, modify, and contribute to its progress. FOSS promotes collaboration, transparency, user empowerment, and frequently leads to the creation of more secure and sustainable software projects. Notable instances include Linux, Blender, Chromium, Kubernetes, and Mozilla Firefox.\r\nWhy FOSS?\r\nFOSS provides users with the liberty to utilize, adapt, and share software based on their preferences. This empowerment extends to both individuals and organizations, granting them control over their tools. The accessibility of the source code enables users to examine the inner workings of the software. FOSS promotes a collaborative model in software development, with a global community of diverse developers contributing to the creation of stronger, more secure, and innovative software. Users retain the freedom to tailor FOSS to meet their specific needs.\r\nQuote from Mohammed Ali Chherawalla’s talk on ‘Building an Open Source Culture in Companies’ during PuneFOSS 2.0 on 24th Feb 2024, describing that Open source is not just about making code publicOpen Source in Government\r\nRahul Kulkarni shared his experiences through his talk on ‘How open source encounters shaped my career’. He highlighted that one should choose open source or enterprise solutions based on the problem to be solved. I particularly liked the insights he gave about the necessity of using open source solutions for building digital platforms to be used by the Government of a country for large scale initiatives which require reaching out to each and every citizen. For example, the digital systems of government issued identity cards in India for various purposes like the AADHAAR UIDAI system. The rationale for the same being that this approach reduces the vendor buy-in, and independence from the roadmaps & timelines of the Enterprise software companies. He explained the importance of Data Empowerment and Protection Architecture (DEPA), which is a secure consent-based data sharing framework to accelerate financial inclusion. Rahul highly recommeded the book ‘The Cathedral and the Bazaar’ by Eric S. Raymond, in which the author explores the contrasting approaches of closed, centralized development (the cathedral) and open, decentralized collaboration (the bazaar) in the world of software development.\r\nRoadmap to Contribute to Open Source content and community\r\nIn an impressive talk on ‘Noobernetes assembly! Sneak Peek into one of the largest Open Source project’, Faeka Ansari provided a comprehensive walkthrough on starting a journey into open source contribution in Kubernetes and growing on the pathway. Drawing from her own experiences, she detailed the contribution pathway and shared valuable insights gained from working with the global Kubernetes community.\r\nFOSS for Social Impact\r\nRohaan Goswami shared his lived experiences around entrepreneurship focusing on the topic ‘Human Centered Technology: Field Notes & Stories of Social Innovation using FOSS in 10+ countries’. Rohaan spoke about the human-centric approach taken towards health tech by his organization YCenter in Africa and India. He also shared the lessons he learnt from working on global projects as diverse as using AI to help Governments make better policy decisions in Africa, developing patient-centric innovations in HPV prevention & cancer care in Southeast Asian countries and creating agritech innovations to support farmers.\r\nPanel Discussion Highlights\r\nThe panel discussion delved into critical questions, such as the interpretation of ‘Free’ - whether in terms of usage or freedom of development. Panelists, including Rahul, Rohaan, Nikhil, and Chakshu, provided diverse perspectives. Nikhil emphasized the government’s reliance on open source for large-scale projects, while Chakshu highlighted the importance of open source documentation as a valuable learning resource.\r\nAddressing Disparity in Github Accounts vs Contributors\r\nOne significant challenge discussed was the vast difference between the number of Github accounts and active contributors in India. The panel suggested initiatives like Code4GovtTech as a countrywide Indian alternative to the global GSoC, and highlighted the role of Consent Manager in India, encouraging attendees to explore its documentation for further insights.\r\nPicture of Jyoti Bhogal, the author of this blog, standing next to the Conference Poster at the PuneFOSS 2.0 eventConclusion\r\nPuneFOSS 2.0 was a melting pot of ideas, experiences, and discussions surrounding the open source community.The event not only showcased the diversity of expertise but also addressed pertinent issues, fostering a collaborative spirit in the pursuit of advancing open source initiatives in India. Check out this page to know more details of event or watch the livestream here.\r\nI had a day full of intriguing discussions with the speakers regsarding problem solving and creating impact in daily life of the user being at the core of any project, and the tools being secondary. The event reinforced my belief in the power of community!\r\nWhat are your thoughts and experiences around the open source philosophy? Leave them in the comments or write back to me at bhogaljyoti1@gmail.com; I am happy to read and reply!\r\n\r\n\r\n\r\n",
    "preview": "blog/PuneFOSS_2.0/open_source_label.jpg",
    "last_modified": "2024-03-11T21:38:53+05:30",
    "input_file": {}
  },
  {
    "path": "blog/pale_blue_dot_sdg_climate_action/",
    "title": "CO2 Chronicles: Navigating SDGs with Data Visuals",
    "description": "Data Insights for Sustainable Development Goals",
    "author": [
      {
        "name": "Jyoti Bhogal",
        "url": "https://jyoti-bhogal.github.io/about-me/"
      }
    ],
    "date": "2023-12-09",
    "categories": [
      "Data visualization",
      "R",
      "Open Science",
      "Open Data",
      "Earth Observation Data",
      "NASA",
      "Geospatial",
      "Maps",
      "Sustainable Development Goal",
      "Climate Action"
    ],
    "contents": "\r\nIntroduction\r\nTo foster a sustainable lifestyle globally, the United Nations has established the Sustainable Development Goals (SDGs), a comprehensive framework consisting of 17 targets set to be achieved by 2030. Each goal is accompanied by specific indicators crucial for determining progress and success.\r\nGoal 13: Climate Action\r\nWithin this framework, Goal 13: Climate Action emerges as a pivotal objective for urgently addressing climate change and its far-reaching impacts. Goal 13 is gauged through two vital indicators:\r\nThe number of countries reporting nationally determined contributions, long-term strategies, national adaptation plans, and adaptation communications to the United Nations Framework Convention on Climate Change secretariat.\r\nTotal greenhouse gas (GHG) emissions per year.\r\nFocus on Indicator 2\r\nThis blog post centers its analysis on Indicator 2, delving into the critical assessment of total GHG emissions per year.\r\nGreenhouse Gases Overview\r\nThe primary greenhouse gases (GHGs) encompass carbon dioxide (CO2), methane, nitrous oxide, ozone, chlorofluorocarbons, and water vapour. With CO2 constituting approximately 76% of total GHGs (source: Inventory of U.S. Greenhouse Gas Emissions and Sinks 1990-2015, EPA, 2017), my analysis will hone in on the dynamics of carbon dioxide.\r\nData Source and Collection\r\nFor this analysis, I leveraged the NASA Earth Observation data, a publicly accessible resource catering to a diverse audience, including students, citizen scientists, researchers, academicians, and industries. Using Terminal commands, I downloaded 2616 data files. Each of these files represents a day from January 1, 2015, to February 28, 2022. These files store records of the Assimilated Dry-Air Column Average CO2 Daily Mean, indexed by latitude and longitude, and are formatted in a .netCDF file. The data download steps drew inspiration from a comprehensive Medium article by Haolin Xiong.\r\nData Analysis in RStudio\r\nHaving secured the data, I imported it into RStudio for further analysis. The variable of interest was graphically represented for each of the 2616 files, with a tailored colour palette to enhance colour contrast between higher and lower values. For those curious about the analytical intricacies, the code is accessible from my Github repository.\r\nEssential R packages for this analysisHere’s a snippet of the codeVisualising CO2 Changes\r\nThe resultant maps offer a vivid representation of the evolving values of the Assimilated Dry-Air Column Average CO2 Daily Mean. These visual cues paint a detailed picture of how CO2 emissions have dynamically evolved across diverse geographical regions. Please look closely at the numerical range in the index at the right of the graphs. Notice how the average value changes from ~390 ppm in 2015 to ~418 ppm in 2022.\r\nJan 2015: Average CO2 LevelsFeb 2022: Average CO2 LevelsWatch the whole video at Daily Global CO2 Assimilation from January 2015 through February 2022.\r\nUnderstanding Seasonal Fluctuations\r\nDiving into the intricacies of annual CO2 fluctuations, we uncover the profound impact of seasonal cycles in photosynthesis. From the Northern Hemisphere spring, where plant growth absorbs CO2, to the autumn, marked by plant decomposition releasing CO2, a symphony of natural processes influences atmospheric CO2 levels. A parallel, albeit milder, pattern plays out in the Southern Hemisphere during opposing seasons.\r\nGoal 13 and Future Targets\r\nThe Goal 13 of SDGs envisions a 43% reduction in GHG emissions by 2030 starting from 2010, culminating in net-zero emissions by 2050. The above graphs as well as sources reveal CO2 levels of approximately 390 ppm in 2010 and 419 ppm in 2023 (Source: Carbon Dioxide | Vital Signs – Climate Change). Indicator 2, reflecting on total GHG emissions, seems to fall short of anticipated targets. Addressing this shortfall requires not only governmental policies but also individual contributions. Transitioning to green fuel vehicles, re-assessing agricultural practices like Stubble burning, increasing vegetation cover, and embracing recycling and reuse initiatives stand as actionable steps towards a sustainable future.\r\n\r\n\r\n\r\n",
    "preview": "blog/pale_blue_dot_sdg_climate_action/banner_climate_action.jpg",
    "last_modified": "2024-03-13T09:05:27+05:30",
    "input_file": {}
  }
]
